#set_false_path -from [get_clocks clk_fpga_1] -to [get_clocks -of_objects [get_pins design_1_i/processing_av_system/clock_generation/clk_wiz_0/inst/CLK_CORE_DRP_I/clk_inst/mmcm_adv_inst/CLKOUT0]]
#set_false_path -from [get_clocks clk_fpga_1] -to [get_clocks -of_objects [get_pins design_1_i/processing_av_system/clock_generation/clk_wiz_2/inst/CLK_CORE_DRP_I/clk_inst/mmcm_adv_inst/CLKOUT0]]
#set_false_path -from [get_clocks -of_objects [get_pins design_1_i/processing_av_system/clock_generation/clk_wiz_2/inst/CLK_CORE_DRP_I/clk_inst/mmcm_adv_inst/CLKOUT0]] -to [get_clocks -of_objects [get_pins design_1_i/processing_av_system/clock_generation/clk_wiz_0/inst/CLK_CORE_DRP_I/clk_inst/mmcm_adv_inst/CLKOUT0]]
#set_false_path -from [get_clocks -of_objects [get_pins design_1_i/processing_av_system/clock_generation/clk_wiz_2/inst/CLK_CORE_DRP_I/clk_inst/mmcm_adv_inst/CLKOUT0]] -to [get_clocks clk_fpga_1]

#set_false_path -from [get_clocks -of_objects [get_pins design_1_i/processing_av_system/clock_generation/clk_wiz_2/inst/CLK_CORE_DRP_I/clk_inst/mmcm_adv_inst/CLKOUT0]] -to [get_clocks clk_fpga_2]
#set_false_path -from [get_clocks -of_objects [get_pins design_1_i/processing_av_system/clock_generation/clk_wiz_0/inst/CLK_CORE_DRP_I/clk_inst/mmcm_adv_inst/CLKOUT1]] -to [get_clocks -of_objects [get_pins design_1_i/processing_av_system/clock_generation/clk_wiz_0/inst/CLK_CORE_DRP_I/clk_inst/mmcm_adv_inst/CLKOUT0]]
#set_false_path -from [get_pins {design_1_i/z3660_0/inst/GPIO_c_reg[*]/C}] -to [get_pins {design_1_i/z3660_0/inst/RAM_state_reg[*]/D}]

#set_false_path -from [get_pins design_1_i/processing_av_system/audio_video_engine/video/video_formatter_0/inst/sprite_dbl_reg/C] -to [get_pins {design_1_i/processing_av_system/audio_video_engine/video/video_formatter_0/inst/need_line_fetch_reg2_reg[1]/D}]
#set_false_path -from [get_clocks clk_fpga_1] -to [get_clocks clk_fpga_2]

#create_clock -period 7.000 -name hdmi_clk -waveform {0.000 3.500} [get_nets hdmi_clk]
#set_output_delay -clock [get_clocks hdmi_clk] -min -5.000 [get_ports {hdmi_data[*]}]
#set_output_delay -clock [get_clocks hdmi_clk] -max 5.000 [get_ports {hdmi_data[*]}]
#set_output_delay -clock [get_clocks hdmi_clk] -min -5.000 [get_ports hdmi_de]
#set_output_delay -clock [get_clocks hdmi_clk] -max 5.000 [get_ports hdmi_de]
#set_output_delay -clock [get_clocks hdmi_clk] -min -5.000 [get_ports hdmi_hs]
#set_output_delay -clock [get_clocks hdmi_clk] -max 5.000 [get_ports hdmi_hs]
#set_output_delay -clock [get_clocks hdmi_clk] -min -5.000 [get_ports hdmi_vs]
#set_output_delay -clock [get_clocks hdmi_clk] -max 5.000 [get_ports hdmi_vs]

set_false_path -from [get_clocks -of_objects [get_pins design_1_i/processing_av_system/clock_generation/clk_wiz_2/inst/CLK_CORE_DRP_I/clk_inst/mmcm_adv_inst/CLKOUT0]] -to [get_clocks clk_fpga_2]

#set_false_path -from [get_pins {design_1_i/processing_av_system/audio_video_engine/video/rst_ps7_0_200M_1/U0/ACTIVE_LOW_PR_OUT_DFF[0].FDRE_PER_N/C}] -to [get_pins {design_1_i/processing_av_system/audio_video_engine/i2s_transmitter_0/inst/I2S_TX_V1_0_SYS_INST/I2S_TX_V1_0_AES_DECODE_INST/rChannelStatusCapt_reg[*]/R}]
set_false_path -from [get_pins design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_CMDSTS/err_i_reg/C] -to [get_pins {design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_SM/GEN_NORMAL_DM_COMMAND.cmnd_data_reg[*]/R}]
set_false_path -from [get_pins design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_CMDSTS/err_i_reg/C] -to [get_pins {design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_SM/VFLIP_DISABLE.dm_address_reg[*]/D}]
#set_false_path -from [get_pins design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/I_RST_MODULE/GEN_RESET_FOR_MM2S.RESET_I/halt_i_reg/C] -to [get_pins {design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_SM/VFLIP_DISABLE.dm_address_reg[*]/D}]
set_false_path -from [get_pins design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_CMDSTS/err_i_reg/C] -to [get_pins {design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/I_RST_MODULE/GEN_RESET_FOR_MM2S.RESET_I/GEN_MIN_FOR_ASYNC.prmry_min_count_reg[*]/CE}]
set_false_path -from [get_pins design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_CMDSTS/err_i_reg/C] -to [get_pins {design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_SM/GEN_NORMAL_DM_COMMAND.cmnd_data_reg[*]/CE}]
set_false_path -from [get_pins design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_CMDSTS/err_i_reg/C] -to [get_pins design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_STS_MNGR/halted_set_i_reg/D]
set_false_path -from [get_pins {design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_SM/FSM_sequential_dmacntrl_cs_reg[0]/C}] -to [get_pins {design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_SM/GEN_NORMAL_DM_COMMAND.cmnd_data_reg[*]/R}]
#set_false_path -from [get_pins {design_1_i/processing_av_system/audio_video_engine/video/rst_ps7_0_200M_1/U0/ACTIVE_LOW_PR_OUT_DFF[0].FDRE_PER_N/C}] -to [get_pins {design_1_i/processing_av_system/audio_video_engine/audio_formatter_0/inst/MM2S_INCLUDED.mm2s_top_1/mm2s_logic_1/PCM_TO_AES.aes_enc1/channel_status_reg_reg[*]/R}]
set_false_path -from [get_pins design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_CMDSTS/err_i_reg/C] -to [get_pins {design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_SM/GEN_NORMAL_DM_COMMAND.cmnd_data_reg[*]/D}]
set_false_path -from [get_pins {design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_SM/FSM_sequential_dmacntrl_cs_reg[2]/C}] -to [get_pins {design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/I_RST_MODULE/GEN_RESET_FOR_MM2S.RESET_I/GEN_MIN_FOR_ASYNC.prmry_min_count_reg[*]/CE}]
set_false_path -from [get_pins {design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_SM/FSM_sequential_dmacntrl_cs_reg[2]/C}] -to [get_pins design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_STS_MNGR/halted_set_i_reg/D]
#set_false_path -from [get_pins {design_1_i/processing_av_system/audio_video_engine/video/rst_ps7_0_200M_1/U0/ACTIVE_LOW_PR_OUT_DFF[0].FDRE_PER_N/C}] -to [get_pins {design_1_i/processing_av_system/audio_video_engine/audio_formatter_0/inst/MM2S_INCLUDED.mm2s_top_1/mm2s_cdc_1/CAPTURE_MM2S.aes_channel_status_reg[*]/R}]
#set_false_path -from [get_pins {design_1_i/processing_av_system/audio_video_engine/video/rst_ps7_0_200M_1/U0/ACTIVE_LOW_PR_OUT_DFF[0].FDRE_PER_N/C}] -to [get_pins {design_1_i/processing_av_system/audio_video_engine/audio_formatter_0/inst/MM2S_INCLUDED.mm2s_top_1/mm2s_logic_1/I_DATAMOVER_MM2S/GEN_MM2S_FULL.I_MM2S_FULL_WRAPPER/I_RD_DATA_CNTL/sig_dbeat_cntr_reg[*]/CE}]
set_false_path -from [get_pins {design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_SM/FSM_sequential_dmacntrl_cs_reg[1]/C}] -to [get_pins {design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/I_RST_MODULE/GEN_RESET_FOR_MM2S.RESET_I/GEN_MIN_FOR_ASYNC.prmry_min_count_reg[*]/CE}]
#set_false_path -from [get_pins design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/I_RST_MODULE/GEN_RESET_FOR_MM2S.RESET_I/halt_i_reg/C] -to [get_pins {design_1_i/processing_av_system/audio_video_engine/video/axi_vdma_0/U0/GEN_SPRT_FOR_MM2S.ADDR32.I_MM2S_DMA_MNGR/I_SM/GEN_NORMAL_DM_COMMAND.cmnd_data_reg[*]/R}]
