create_clock -period 6.734 -name VIRTUAL_clk_out1_design_1_clk_wiz_2_0_1 -waveform {0.000 3.367}
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_design_1_clk_wiz_2_0_1] -min -add_delay 10.000 [get_ports {hdmi_data[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_design_1_clk_wiz_2_0_1] -max -add_delay 4.000 [get_ports {hdmi_data[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_design_1_clk_wiz_2_0_1] -min -add_delay 10.000 [get_ports hdmi_de]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_design_1_clk_wiz_2_0_1] -max -add_delay 4.000 [get_ports hdmi_de]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_design_1_clk_wiz_2_0_1] -min -add_delay 10.000 [get_ports hdmi_hs]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_design_1_clk_wiz_2_0_1] -max -add_delay 4.000 [get_ports hdmi_hs]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_design_1_clk_wiz_2_0_1] -min -add_delay 10.000 [get_ports hdmi_vs]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_design_1_clk_wiz_2_0_1] -max -add_delay 4.000 [get_ports hdmi_vs]

create_clock -period 54.255 -name VIRTUAL_clk_out1_design_1_clk_wiz_3_0_1 -waveform {0.000 27.128}
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_design_1_clk_wiz_3_0_1] -min -add_delay -1.000 [get_ports I2SO_D0]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_design_1_clk_wiz_3_0_1] -max -add_delay 4.000 [get_ports I2SO_D0]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_design_1_clk_wiz_3_0_1] -min -add_delay -1.000 [get_ports I2S_FSYNC_OUT]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_design_1_clk_wiz_3_0_1] -max -add_delay 4.000 [get_ports I2S_FSYNC_OUT]


set_false_path -from [get_clocks AXI_clk_design_1_clk_wiz_0_0] -to [get_clocks clk_fpga_1]

set_false_path -from [get_clocks clk_fpga_1] -to [get_clocks -of_objects [get_pins design_1_i/processing_av_system/clock_generation/clk_wiz_2/inst/CLK_CORE_DRP_I/clk_inst/mmcm_adv_inst/CLKOUT0]]
set_multicycle_path -from [get_clocks -of_objects [get_pins design_1_i/processing_av_system/clock_generation/clk_wiz_2/inst/CLK_CORE_DRP_I/clk_inst/mmcm_adv_inst/CLKOUT0]] -to [get_clocks VIRTUAL_clk_out1_design_1_clk_wiz_2_0_1] 3
set_false_path -from [get_clocks -of_objects [get_pins design_1_i/processing_av_system/clock_generation/clk_wiz_2/inst/CLK_CORE_DRP_I/clk_inst/mmcm_adv_inst/CLKOUT0]] -to [get_clocks clk_fpga_2]
set_false_path -from [get_clocks -of_objects [get_pins design_1_i/processing_av_system/clock_generation/clk_wiz_2/inst/CLK_CORE_DRP_I/clk_inst/mmcm_adv_inst/CLKOUT0]] -to [get_clocks clk_fpga_1]


set_false_path -from [get_clocks -of_objects [get_pins design_1_i/processing_av_system/clock_generation/clk_wiz_2/inst/CLK_CORE_DRP_I/clk_inst/mmcm_adv_inst/CLKOUT0]] -to [get_clocks -of_objects [get_pins design_1_i/processing_av_system/clock_generation/clk_wiz_0/inst/CLK_CORE_DRP_I/clk_inst/mmcm_adv_inst/CLKOUT0]]
set_false_path -from [get_clocks clk_fpga_1] -to [get_clocks -of_objects [get_pins design_1_i/processing_av_system/clock_generation/clk_wiz_0/inst/CLK_CORE_DRP_I/clk_inst/mmcm_adv_inst/CLKOUT1]]

set_property DRIVE 16 [get_ports {A060[*]}]
set_property SLEW FAST [get_ports {A060[*]}]
set_property PULLTYPE PULLUP [get_ports {A060[31]}]
set_property PULLTYPE PULLUP [get_ports {A060[30]}]
set_property PULLTYPE PULLUP [get_ports {A060[29]}]
set_property PULLTYPE PULLUP [get_ports {A060[28]}]
set_property PULLTYPE PULLUP [get_ports {A060[27]}]
set_property PULLTYPE PULLUP [get_ports {A060[26]}]
set_property PULLTYPE PULLUP [get_ports {A060[25]}]
set_property PULLTYPE PULLUP [get_ports {A060[24]}]
set_property PULLTYPE PULLUP [get_ports {A060[23]}]
set_property PULLTYPE PULLUP [get_ports {A060[22]}]
set_property PULLTYPE PULLUP [get_ports {A060[21]}]
set_property PULLTYPE PULLUP [get_ports {A060[20]}]
set_property PULLTYPE PULLUP [get_ports {A060[19]}]
set_property PULLTYPE PULLUP [get_ports {A060[18]}]
set_property PULLTYPE PULLUP [get_ports {A060[17]}]
set_property PULLTYPE PULLUP [get_ports {A060[16]}]
set_property PULLTYPE PULLUP [get_ports {A060[15]}]
set_property PULLTYPE PULLUP [get_ports {A060[14]}]
set_property PULLTYPE PULLUP [get_ports {A060[13]}]
set_property PULLTYPE PULLUP [get_ports {A060[12]}]
set_property PULLTYPE PULLUP [get_ports {A060[11]}]
set_property PULLTYPE PULLUP [get_ports {A060[10]}]
set_property PULLTYPE PULLUP [get_ports {A060[9]}]
set_property PULLTYPE PULLUP [get_ports {A060[8]}]
set_property PULLTYPE PULLUP [get_ports {A060[7]}]
set_property PULLTYPE PULLUP [get_ports {A060[6]}]
set_property PULLTYPE PULLUP [get_ports {A060[5]}]
set_property PULLTYPE PULLUP [get_ports {A060[4]}]
set_property PULLTYPE PULLUP [get_ports {A060[3]}]
set_property PULLTYPE PULLUP [get_ports {A060[2]}]
set_property PULLTYPE PULLUP [get_ports {A060[1]}]
set_property PULLTYPE PULLUP [get_ports {A060[0]}]
set_property PULLTYPE PULLUP [get_ports {D040[31]}]
set_property PULLTYPE PULLUP [get_ports {D040[30]}]
set_property PULLTYPE PULLUP [get_ports {D040[29]}]
set_property PULLTYPE PULLUP [get_ports {D040[28]}]
set_property PULLTYPE PULLUP [get_ports {D040[27]}]
set_property PULLTYPE PULLUP [get_ports {D040[26]}]
set_property PULLTYPE PULLUP [get_ports {D040[25]}]
set_property PULLTYPE PULLUP [get_ports {D040[24]}]
set_property PULLTYPE PULLUP [get_ports {D040[23]}]
set_property PULLTYPE PULLUP [get_ports {D040[22]}]
set_property PULLTYPE PULLUP [get_ports {D040[21]}]
set_property PULLTYPE PULLUP [get_ports {D040[20]}]
set_property PULLTYPE PULLUP [get_ports {D040[19]}]
set_property PULLTYPE PULLUP [get_ports {D040[18]}]
set_property PULLTYPE PULLUP [get_ports {D040[17]}]
set_property PULLTYPE PULLUP [get_ports {D040[16]}]
set_property PULLTYPE PULLUP [get_ports {D040[15]}]
set_property PULLTYPE PULLUP [get_ports {D040[14]}]
set_property PULLTYPE PULLUP [get_ports {D040[13]}]
set_property PULLTYPE PULLUP [get_ports {D040[12]}]
set_property PULLTYPE PULLUP [get_ports {D040[11]}]
set_property PULLTYPE PULLUP [get_ports {D040[10]}]
set_property PULLTYPE PULLUP [get_ports {D040[9]}]
set_property PULLTYPE PULLUP [get_ports {D040[8]}]
set_property PULLTYPE PULLUP [get_ports {D040[7]}]
set_property PULLTYPE PULLUP [get_ports {D040[6]}]
set_property PULLTYPE PULLUP [get_ports {D040[5]}]
set_property PULLTYPE PULLUP [get_ports {D040[4]}]
set_property PULLTYPE PULLUP [get_ports {D040[3]}]
set_property PULLTYPE PULLUP [get_ports {D040[2]}]
set_property PULLTYPE PULLUP [get_ports {D040[1]}]
set_property PULLTYPE PULLUP [get_ports {D040[0]}]
set_property DRIVE 16 [get_ports INT6_ARM]
set_property DRIVE 16 [get_ports R_W040]
set_property DRIVE 16 [get_ports {SIZ40[0]}]
set_property DRIVE 16 [get_ports {SIZ40[1]}]
set_property DRIVE 16 [get_ports nTA]
set_property DRIVE 16 [get_ports nTBI]
set_property DRIVE 16 [get_ports nTS_FPGA]
set_property SLEW FAST [get_ports INT6_ARM]
set_property SLEW FAST [get_ports R_W040]
set_property SLEW FAST [get_ports {SIZ40[0]}]
set_property SLEW FAST [get_ports {SIZ40[1]}]
set_property SLEW FAST [get_ports nTA]
set_property SLEW FAST [get_ports nTBI]
set_property SLEW FAST [get_ports nTS_FPGA]
set_property PULLTYPE PULLUP [get_ports INT6_ARM]
set_property PULLTYPE PULLUP [get_ports R_W040]
set_property PULLTYPE PULLUP [get_ports {SIZ40[0]}]
set_property PULLTYPE PULLUP [get_ports {SIZ40[1]}]
set_property PULLTYPE PULLUP [get_ports nTA]
set_property PULLTYPE PULLUP [get_ports nTBI]
set_property PULLTYPE PULLUP [get_ports nTS_FPGA]
set_property SLEW FAST [get_ports BCLK_clk]
set_property SLEW FAST [get_ports CLK90_clk]
set_property SLEW FAST [get_ports CPUCLK_clk]
set_property SLEW FAST [get_ports I2S_SCLK]
set_property SLEW FAST [get_ports PCLK_clk]
set_property SLEW FAST [get_ports nCLKEN_clk]

#create_clock -name virtual_Pclk -period 10 [get_ports PCLK_clk]
#set_input_delay -clock virtual_Pclk -max -2 [get_ports A060[*]]
#set_input_delay -clock virtual_Pclk -min 2 [get_ports A060[*]]
#set_input_delay -clock virtual_Pclk -max -2 [get_ports D040[*]]
#set_input_delay -clock virtual_Pclk -min 2 [get_ports D040[*]]

#set_output_delay -clock virtual_Pclk -max -8 [get_ports A060[*]]
#set_output_delay -clock virtual_Pclk -min -2 [get_ports A060[*]]
#set_output_delay -clock virtual_Pclk -max -8 [get_ports D040[*]]
#set_output_delay -clock virtual_Pclk -min -2 [get_ports D040[*]]


set_false_path -from [get_pins {design_1_i/z3660_0/inst/s01_slv_reg2_reg[*]/C}] -to [get_pins design_1_i/z3660_0/inst/BP_STATE_reg/D]
set_false_path -from [get_pins {design_1_i/z3660_0/inst/s01_slv_reg2_reg[*]/C}] -to [get_pins design_1_i/z3660_0/inst/bp_out_reg/D]

set_false_path -from [get_pins {design_1_i/z3660_0/inst/s01_slv_reg2_reg[*]/C}] -to [get_pins {design_1_i/z3660_0/inst/counter_reg[*]/R}]

set_false_path -from [get_pins {design_1_i/z3660_0/inst/s01_slv_reg2_reg[*]/C}] -to [get_pins design_1_i/z3660_0/inst/bp_out_reg/R]
set_false_path -from [get_pins {design_1_i/z3660_0/inst/s01_slv_reg2_reg[*]/C}] -to [get_pins {design_1_i/z3660_0/inst/counter_reg[*]/CE}]

set_false_path -from [get_pins {design_1_i/z3660_0/inst/s01_slv_reg3_reg[*]/C}] -to [get_pins design_1_i/z3660_0/inst/BP_STATE_reg/D]

set_false_path -from [get_pins {design_1_i/z3660_0/inst/GPIO_s_reg[*]/C}] -to [get_pins design_1_i/z3660_0/inst/bp_out_reg/D]
set_false_path -from [get_pins {design_1_i/z3660_0/inst/GPIO_s_reg[*]/C}] -to [get_pins design_1_i/z3660_0/inst/BP_STATE_reg/D]
